{
    "number": 1,
    "year": "476",
    "event": "Fall of Rome",
    "summary": "The gradual decline of the Roman Empire was marked with political instability as emperors were assassinated quickly after taking the throne. Reforms by Emperors Diocletian and Constantine failed to solve the socioeconomic problems threatening the empire. In 476, Odoacer, a Germanic leader, expelled the Roman emperor, signalling the formal “fall” of the Rome to foreign invaders."
},
{
    "number": 2,
    "year": "622",
    "event": "Muhammad's Hijra",
    "summary": "Muhammad, an Arabian merchant disturbed by the immorality of Meccan society, heard an angel calling him to be the messenger of God. His teachings were harshly rejected, so he and his followers journeyed from Mecca to Yathrib, later renamed Medina (city of the Prophet), in a trip known as the hijra."
},
{
    "number": 3,
    "year": "800",
    "event": "Charlemagne Crowned Emperor",
    "summary": "Charlemagne, grandson of Charles Martel, who had victoriously led Christians against invading Muslims, became King of the Franks in 768. During his 46-year reign, Charlemagne united Western Europe and was crowned Emperor of the Romans on Christmas Day for assisting Pope Leo III suppress rebels. Charlemagne sought to further improve his realm through Christianity and education."
},
{
    "number": 4,
    "year": "900s",
    "event": "Feudalism Develops",
    "summary": "Feudalism, developed in response to the need for protection of people and their lands, was the social and political system of medieval Europe. A system of mutual obligations defined by feudal contracts bound all members of society together. The monarch granted fiefs, or land, who then distributed them to lesser lords. Vassals, or people to whom fiefs were given, owed loyalty and military service to their lords in exchange for land and protection. Serfs and peasants worked on the land while receiving protection and shelter on their lord’s self-sufficient, isolated manor. The feudal system dominated Europe in conjunction with the manor economy for several centuries until various factors, including the Black Death, Crusades, and political changes in England and France, brought about its downfall."
},
{
    "number": 5,
    "year": "1054",
    "event": "The Great Schism",
    "summary": "Christian practices differed between Western Europe and the Byzantine Empire, causing rising tensions. The use of icons, criticized as “graven images”, was temporarily outlawed, sparking violent battles that led to the Great Schism, resulting in a separation of the Eastern, or Greek, Orthodox Church and Roman Catholic Church. The Roman pope and Byzantine patriarch excommunicated each other."
},
{
    "number": 6,
    "year": "1096",
    "event": "Crusades Begin",
    "summary": "Byzantine emperor Alexius I asked Pope Urban II for assistance in fighting Muslim Seljuk Turks in order to regain access to the Christian Holy Land. At the Council of Clermont in 1095, Urban rallied clergy, knights, and ordinary people, who fought in a total of four campaigns. Ultimately, the Crusades resulted in religious hatred, but also expanded the worldview of Europeans."
},
{
    "number": 7,
    "year": "1215",
    "event": "King John Signs the Magna Carta",
    "summary": "King John of England was an unpopular monarch who became enemies with King Philip II of France, Pope Innocent III, and the English nobles. Discontent barons drew up a document called the Magna Carta and forced King John to sign it. The Magna Carta granted certain rights to nobles and introduced the ideas of due process of law and habeas corpus into the legal system."
},
{
    "number": 8,
    "year": "1324",
    "event": "Mansa Musa Makes Pilgrimage to Mecca"
},
{
    "number": 9,
    "event": "Renaissance Begins"
},
{
    "number": 10,
    "event": "Joan of Arc Leads the French"
},
{
    "number": 11,
    "event": "Gutenberg's Bible is Printed"
},
{
    "number": 12,
    "event": "Spanish Reconquista / Columbus"
},
{
    "number": 13,
    "event": "Michelangelo's David"
},
{
    "number": 14,
    "event": "Luther Posts his 95 Theses"
},
{
    "number": 15,
    "event": "Magellan's Crew Finishes Trip"
},
{
    "number": 16,
    "event": "Galileo's Trial"
},
{
    "number": 17,
    "event": "English Civil War"
},
{
    "number": 18,
    "event": "Louis XIV Revokes the Edict of Nantes"
},
{
    "number": 19,
    "event": "The Glorious Revolution"
},
{
    "number": 20,
    "event": "Two Treatises of Government"
},
{
    "number": 21,
    "event": "Montesquieu's \"Spirit of Laws\""
},
{
    "number": 22,
    "event": "The Storming of the Bastille"
},
{
    "number": 23,
    "event": "The Reign of Terror"
},
{
    "number": 24,
    "event": "Napoleon Takes Power / Waterloo"
},
{
    "number": 25,
    "event": "The Communist Manifesto"
}
